In [5]:
import pandas as pd

In [1]:
#data1 = pd.read_excel(r'â€ªC:\Users\LENOVO\Desktop\mydata3.xlsx')

In [24]:
data2 = pd.read_csv(r'C:\Users\LENOVO\Desktop\mydata1.csv')

In [18]:
data2

     Name   Age  Salary
0  Shubham   24   15000
1   nikhil   24   25000
2   sujeet   24   10000

In [21]:
data3= pd.read_csv(r'C:\Users\LENOVO\Desktop\mydata2.tsv',sep='\t')

In [22]:
data3

       Rollno  Name  Batch
1001  shubham  1840    NaN
1002   nikhil  1839    NaN
1003   sujeet  1838    NaN